tylerb32/STM32_Test_Dev_Board-REV1.1/firmware/STM32_Dev_Board-FW.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L0
RCC.MSI_VALUE=2097000
ProjectManager.MainLocation=Core/Src
PB13.GPIOParameters=GPIO_Label
ProjectManager.ProjectFileName=STM32_Dev_Board-FW.ioc
PH0-OSC_IN.Signal=RCC_OSC_IN
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
PA7.Mode=Simplex_Bidirectional_Master
ProjectManager.KeepUserCode=true
PA10.Mode=I2C
Mcu.UserName=STM32L031C4Tx
Mcu.PinsNb=20
SPI1.VirtualType=VM_MASTER
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
RCC.LPUARTFreq_Value=8000000
RCC.PLLCLKFreq_Value=24000000
PB14.GPIO_Label=SW_GP3
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false
PA11.GPIOParameters=GPIO_Label
RCC.RTCFreq_Value=37000
PA11.GPIO_Label=LED_GP
ProjectManager.DefaultFWLocation=true
PB0.GPIO_Label=LCD_RST
RCC.USART2Freq_Value=8000000
PB12.Locked=true
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
PB14.Locked=true
PB13.GPIO_Label=SW_GP2
RCC.TimerFreq_Value=8000000
PB13.Signal=GPIO_Input
USART2.BaudRate=115384
PinOutPanel.RotationAngle=0
PA12.GPIO_Label=LED_STATUS
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSE
ProjectManager.StackSize=0x400
RCC.WatchDogFreq_Value=37000
PA13.Signal=SYS_SWDIO
Mcu.IP4=SYS
RCC.HSI16_VALUE=16000000
RCC.FCLKCortexFreq_Value=8000000
Mcu.IP5=USART2
I2C1.IPParameters=Timing
Mcu.IP2=RCC
Mcu.IP3=SPI1
Mcu.IP0=I2C1
PA9.Mode=I2C
PA11.Locked=true
PA12.Locked=true
Mcu.IP1=NVIC
PA12.Signal=GPIO_Output
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_1LINE
RCC.HCLKFreq_Value=8000000
Mcu.IPNb=6
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=8000000
PA9.Signal=I2C1_SCL
PB2.GPIOParameters=GPIO_Label
PB6.Signal=USART2_TX
I2C1.Timing=0x2000090E
PB6.Mode=Asynchronous
SPI1.CalculateBaudRate=4.0 MBits/s
Mcu.Pin6=PB1
Mcu.Pin7=PB2
ProjectManager.RegisterCallBack=
Mcu.Pin8=PB12
Mcu.Pin9=PB13
RCC.LSE_VALUE=32768
RCC.AHBFreq_Value=8000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
PB13.Locked=true
Mcu.Pin0=PH0-OSC_IN
PB1.Locked=true
Mcu.Pin1=PH1-OSC_OUT
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA4
Mcu.Pin3=PA5
Mcu.Pin4=PA7
Mcu.Pin5=PB0
PB14.Signal=GPIO_Input
PA5.Signal=SPI1_SCK
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
RCC.MCOPinFreq_Value=8000000
PB2.Signal=GPIO_Output
board=custom
PA4.Locked=true
USART2.VirtualMode-Asynchronous=VM_ASYNC
RCC.VCOOutputFreq_Value=48000000
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
PB12.GPIO_Label=SW_GP1
ProjectManager.FirmwarePackage=STM32Cube FW_L0 V1.12.0
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=GPIO_Label
RCC.APB2Freq_Value=8000000
ProjectManager.BackupPrevious=false
MxCube.Version=6.2.1
RCC.I2C1Freq_Value=8000000
SPI1.Mode=SPI_MODE_MASTER
PA14.Mode=Serial_Wire
PB1.GPIO_Label=LCD_A0
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PB7.Signal=USART2_RX
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI16_VALUE,HSI_VALUE,I2C1Freq_Value,LPTIMFreq_Value,LPUARTFreq_Value,LSE_VALUE,LSI_VALUE,MCOPinFreq_Value,MSI_VALUE,PLLCLKFreq_Value,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,USART2Freq_Value,VCOOutputFreq_Value,WatchDogFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L031C(4-6)Tx
ProjectManager.HalAssertFull=false
PB0.Locked=true
RCC.RTCHSEDivFreq_Value=4000000
ProjectManager.ProjectName=STM32_Dev_Board-FW
ProjectManager.UnderRoot=true
PB2.Locked=true
ProjectManager.CoupleFile=false
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=8000000
Mcu.Package=LQFP48
PB1.Signal=GPIO_Output
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=37000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB7.Mode=Asynchronous
PA11.Signal=GPIO_Output
PA10.Signal=I2C1_SDA
PA14.Signal=SYS_SWCLK
PB2.GPIO_Label=LCD_LED
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA13
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PA14
Mcu.Pin13=PA11
Mcu.Pin14=PA12
PB14.GPIOParameters=GPIO_Label
Mcu.Pin19=VP_SYS_VS_Systick
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB6
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB7
Mcu.Pin11=PA9
Mcu.Pin12=PA10
Mcu.Pin10=PB14
PB7.Locked=true
RCC.APB1TimFreq_Value=8000000
RCC.PWRFreq_Value=8000000
RCC.APB1Freq_Value=8000000
PB0.Signal=GPIO_Output
PA4.GPIO_Label=LCD_CS
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32L031C4Tx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Input
ProjectManager.LibraryCopy=1
RCC.LPTIMFreq_Value=8000000
PB1.GPIOParameters=GPIO_Label
PA5.Mode=Simplex_Bidirectional_Master
PA7.Signal=SPI1_MOSI
RCC.TIMFreq_Value=8000000
isbadioc=false
